In [18]:
import pandas as pd
import plotly.graph_objs as go

ModuleNotFoundError: No module named 'matplotlib'

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/austinlasseter/plotly_dash_tutorial/master/00%20resources/titanic.csv")

In [15]:
df.head()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Female,Cabin Class,death_var,age_groups,fare_groups
0,0,0,3,male,22.0,7.2500,Southampton,0,third,died,2 young adult,1 low
1,1,1,1,female,38.0,71.2833,Cherbourg,1,first,lived,3 middle-aged,4 very high
2,2,1,3,female,26.0,7.9250,Southampton,1,third,lived,2 young adult,1 low
3,3,1,1,female,35.0,53.1000,Southampton,1,first,lived,3 middle-aged,4 very high
4,4,0,3,male,35.0,8.0500,Southampton,0,third,died,3 middle-aged,2 medium

In [4]:
df['Female']=df['Sex'].map({'male':0, 'female':1})

In [5]:
df['Cabin Class'] = df['Pclass'].map({1:'first', 2: 'second', 3:'third'})
df.head()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Female,Cabin Class
0,0,0,3,male,22.0,7.2500,Southampton,0,third
1,1,1,1,female,38.0,71.2833,Cherbourg,1,first
2,2,1,3,female,26.0,7.9250,Southampton,1,third
3,3,1,1,female,35.0,53.1000,Southampton,1,first
4,4,0,3,male,35.0,8.0500,Southampton,0,third

In [6]:
df['death_var']=df['Survived'].map({0:'died', 1: 'lived'})
df.head()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Female,Cabin Class,death_var
0,0,0,3,male,22.0,7.2500,Southampton,0,third,died
1,1,1,1,female,38.0,71.2833,Cherbourg,1,first,lived
2,2,1,3,female,26.0,7.9250,Southampton,1,third,lived
3,3,1,1,female,35.0,53.1000,Southampton,1,first,lived
4,4,0,3,male,35.0,8.0500,Southampton,0,third,died

In [7]:
# Create a list with those 5 values as cut points. (props if you can do this without hard-coding them!)
mybins=[0,18,30,60,80]

# Create some labels for the new variable. NOTE: There are 5 cut points but only four labels. Why is that?
mylabels=['1 children', '2 young adult', '3 middle-aged', '4 elderly']
# Use the .cut method to create a new variable using those cut points and labels.
df['age_groups']= pd.cut(df['Age'], bins=mybins, labels=mylabels)
# Check it out!
df[['Age','age_groups']].head()

    Age     age_groups
0  22.0  2 young adult
1  38.0  3 middle-aged
2  26.0  2 young adult
3  35.0  3 middle-aged
4  35.0  3 middle-aged

In [8]:
# Create 5 cut points for our new bins.
farebins=[0,8,15,33,512]
# Create 4 labels (wait, why only four?)
farelabels=['1 low', '2 medium', '3 high','4 very high']
# Create the new variable using pd.cut
df['fare_groups']= pd.cut(df['Fare'], bins=farebins, labels=farelabels)
# Check it out.
df[['Fare', 'fare_groups']].head()

      Fare  fare_groups
0   7.2500        1 low
1  71.2833  4 very high
2   7.9250        1 low
3  53.1000  4 very high
4   8.0500     2 medium

## Summary statistics

In [9]:
df.columns

Index(['Unnamed: 0', 'Survived', 'Pclass', 'Sex', 'Age', 'Fare', 'Embarked',
       'Female', 'Cabin Class', 'death_var', 'age_groups', 'fare_groups'],
      dtype='object')

In [10]:
# What are the categorical variables?
cats=['Sex','Embarked', 'Cabin Class','death_var', 'age_groups', 'fare_groups']

In [11]:
# What are the continuous variables?
cons=['Survived', 'Age', 'Fare', 'Female']

### Single bar chart (counts)

In [12]:
# What are the frequencies for Embarked?
embarked_counts = df['Embarked'].value_counts()
print(embarked_counts)
# Turn that into a bar chart.
embarked_counts.plot(kind = 'bar');

Southampton    554
Cherbourg      130
Queenstown      28
Name: Embarked, dtype: int64

ImportError: matplotlib is required for plotting when the default backend "matplotlib" is selected.

### Single bar chart (percents)

In [ ]:
# survival by cabin class?
cab_survive = df.groupby('Cabin Class')['Survived'].mean()
cab_survive

### Grouped bar chart

In [ ]:
# Sex by embarkation
sex_embark = pd.crosstab(df['Sex'], df['Embarked'])
sex_embark

## Grouped bar chart (3 variables)

In [ ]:
results=pd.DataFrame(df.groupby(['Sex', 'Embarked'])['Fare'].mean())
results

In [ ]:
# So to better understand how this works, we need to know multi-indexing.
print(results.loc['male'].index)
results.loc['male']['Fare']

In [ ]:
# Let's display that with plotly.
mydata1 = go.Bar(
    x=results.loc['male'].index,
    y=results.loc['male']['Fare'],
    name='Male',
    marker=dict(color='darkgreen')
)
mydata2 = go.Bar(
    x=results.loc['female'].index,
    y=results.loc['female']['Fare'],
    name='Female',
    marker=dict(color='lightblue')
)

mylayout = go.Layout(
    title='Grouped bar chart',
    xaxis = dict(title = 'Port of Embarkation'), # x-axis label
    yaxis = dict(title = 'Number of Passengers'), # y-axis label
    
)
fig = go.Figure(data=[mydata1, mydata2], layout=mylayout)
fig.show()

## Cabin class by port of embarkation

In [ ]:
# continuous_var='Fare'
# continuous_var='Age'
# continuous_var='Female'
continuous_var='Survived'

In [ ]:
results=pd.DataFrame(df.groupby(['Embarked', 'Cabin Class'])[continuous_var].mean())
results

In [ ]:
# So to better understand how this works, we need to know multi-indexing.
print(results.loc['first'].index)
results.loc['first'][continuous_var]

In [13]:
# Let's display that with plotly.
mydata1 = go.Bar(
    x=results.loc['Cherbourg'].index,
    y=results.loc['Cherbourg'][continuous_var],
    name='Cherbourg',
    marker=dict(color='darkblue')
)
mydata2 = go.Bar(
    x=results.loc['Queenstown'].index,
    y=results.loc['Queenstown'][continuous_var],
    name='Queenstown',
    marker=dict(color='lightred')
)
mydata3 = go.Bar(
    x=results.loc['Southampton'].index,
    y=results.loc['Southampton'][continuous_var],
    name='Southampton',
    marker=dict(color='orange')
)

mylayout = go.Layout(
    title='Grouped bar chart',
    xaxis = dict(title = 'Cabin Class'), # x-axis label
    yaxis = dict(title = str(continuous_var)), # y-axis label
    
)
fig = go.Figure(data=[mydata1, mydata2, mydata3], layout=mylayout)
fig.show()

NameError: name 'results' is not defined